ICARUS/Input_Output/OpenFoam/files/0/nut
/*----------------------------------------------------------------------------------*\
|                                                                                    | 
|    ANSA_VERSION: 22.1.0                                                            | 
|                                                                                    | 
|    file created by  A N S A  Mon Feb 28 15:04:06 2022                              | 
|                                                                                    | 
|    Output from: /home/dvlastos/TzimiNiki/Untitled.ansa                             | 
|                                                                                    | 
\*----------------------------------------------------------------------------------*/



FoamFile
{
	version 2.0;
	format binary;
	class volScalarField;
	location "";
	object nut;
}
/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/


dimensions [0 2 -1 0 0 0 0];

internalField uniform 0.;


boundaryField
{
	Farfield
	{
		type calculated;
		value uniform 0.;
	}

	Airfoil
	{
		type nutUSpaldingWallFunction;
		value uniform 0.;
	}

	SideHigh
	{
		type empty;
	}

	SideLow
	{
		type empty;
	}

}
